.planning/case_profiles/case_031_v65_naca0012_supersonic_v106_retry_dicts/system/FOMachNo
// -*- C++ -*-

MachNo1
{
    // Mandatory entries
    type            MachNo;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    field           U;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
