.planning/case_profiles/case_031_v65_naca0012_supersonic_v106_retry_dicts/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega );


// ************************************************************************* //
